tap "github/gh"
tap "golangci/tap"
tap "goreleaser/tap"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "superfly/tap"
tap "teamookla/speedtest"
# Record and share terminal sessions
brew "asciinema"
# Official Amazon AWS command-line interface
brew "awscli", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Persistent key-value database, with built-in net interface
brew "redis"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser-pro"
# NFPM is a simple, 0-dependencies, deb, rpm and apk packager.
brew "goreleaser/tap/nfpm"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Watch local content on Apple TV and Chromecast
cask "airflow"
cask "beardedspice"
cask "deckset"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# End-to-end encryption software
cask "keybase"
# App to manage software development and track bugs
cask "linear-linear"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Create deployments right from the tray menu
cask "now"
cask "postgres"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
